oskarbjo/NRF52/_DONT_USEble_transmit_SPI_52820/pca10100/s140/ses/main.c
    err_code = sd_ble_gap_ppcp_set(&m_conn_param);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT library. */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t ret;
    ret = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(ret);
}


void preferred_phy_set(ble_gap_phys_t * p_phy)
{
    memcpy(&m_test_params.phys, p_phy, sizeof(ble_gap_phys_t));
}


void gatt_mtu_set(uint16_t att_mtu)
{
    ret_code_t err_code;

    m_test_params.att_mtu = att_mtu;

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, att_mtu);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_central_set(&m_gatt, att_mtu);
    APP_ERROR_CHECK(err_code);
}


void connection_interval_set(uint16_t value)
{
    m_test_params.conn_interval = value;
}


void conn_evt_len_ext_set(bool status)
{
    ret_code_t err_code;
    ble_opt_t  opt;

    memset(&opt, 0x00, sizeof(opt));
    opt.common_opt.conn_evt_ext.enable = status ? 1 : 0;

    err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
    APP_ERROR_CHECK(err_code);

    m_test_params.conn_evt_len_ext_enabled = status;
}


void data_len_set(uint8_t value)
{
    ret_code_t err_code;
    err_code = nrf_ble_gatt_data_length_set(&m_gatt, BLE_CONN_HANDLE_INVALID, value);
    APP_ERROR_CHECK(err_code);

    m_test_params.data_len = value;
}


bool is_tester_board(void)
{
    return (m_board_role == BOARD_TESTER);
}



void test_begin(void)
{
    NRF_LOG_INFO("Preparing the test.");
    NRF_LOG_FLUSH();

#if defined(S132)
    // PHY does not need to be updated for s132.
     m_phy_updated = true;
#endif

    switch (m_gap_role)
    {
        default:
            // If no connection was established, the role is not established either.
            // In this case, start both the advertising and the scanning.
            advertising_start();
            //scan_start();
            break;

        case BLE_GAP_ROLE_PERIPH:
            advertising_start();
            m_test_params.phys.tx_phys = BLE_GAP_PHY_2MBPS;
            break;

        case BLE_GAP_ROLE_CENTRAL:
            //scan_start();
            break;
    }
}


static void test_run(void)
{
    //counter_start();
    nrf_ble_amts_notif_spam(&m_amts);
}


static bool is_test_ready()
{
    return (   (m_board_role == BOARD_TESTER)
            && m_conn_interval_configured
            && m_notif_enabled
            && m_mtu_exchanged
            && (m_data_length_updated || m_test_params.data_len == DATA_LENGTH_DEFAULT)
            && !m_run_test);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details Handles any pending operations, then sleeps until the next event occurs.
 */
static void idle_state_handle(void)
{

    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


static void test_terminate(void)
{
    m_run_test                 = false;
    m_notif_enabled            = false;
    m_mtu_exchanged            = false;
    m_data_length_updated      = false;
    m_phy_updated              = false;
    m_conn_interval_configured = false;

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        NRF_LOG_INFO("Disconnecting...");

        ret_code_t err_code;
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

        if (err_code != NRF_SUCCESS)
        {
            NRF_LOG_ERROR("sd_ble_gap_disconnect() failed: 0x%0x.", err_code);
        }
    }
    else
    {
        if (m_board_role == BOARD_DUMMY)
        {
            if (m_gap_role == BLE_GAP_ROLE_PERIPH)
            {
                advertising_start();
            }
            else
            {
                //scan_start();
            }
        }
    }
}





void spi_event_handler(nrf_drv_spi_evt_t const * p_event,
                       void *                    p_context)
{
    spi_xfer_done = true;
}

void send_SPI_RX_buf(nrf_ble_amts_t * p_ctx){


    char *data = output_buffer;
    //for(int kk=0;kk<sizeof(data);kk++){
    //  NRF_LOG_INFO("Data sent %d: %d",kk,data[kk]);
    //}
    //uint16_t           payload_len = p_ctx->max_payload_len;
    uint16_t payload_len = sizeof(output_buffer);
    nrf_ble_amts_evt_t evt;

    ble_gatts_hvx_params_t const hvx_param =
    {
        .type   = BLE_GATT_HVX_NOTIFICATION,
        .handle = p_ctx->amts_char_handles.value_handle,
        .p_data = data,
        .p_len  = &payload_len,
    };

    uint32_t err_code = NRF_SUCCESS;

    //NRF_LOG_INFO("Sending data...");
    err_code = sd_ble_gatts_hvx(p_ctx->conn_handle, &hvx_param);

    if (err_code == NRF_ERROR_RESOURCES)
    {
        // Wait for BLE_GATTS_EVT_HVN_TX_COMPLETE.
        p_ctx->busy = true;
    }
    else if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("sd_ble_gatts_hvx() failed: 0x%x", err_code);
        return;
    }
    //NRF_LOG_INFO("Data successfully transmitted");


}


void readAccelerometer(){
           //nrf_drv_spi_transfer(&spi, m_tx_buf2, 1, m_rx_buf, 2);
          nrf_drv_spi_transfer(&spi, m_tx_buf_ACC,7, m_rx_buf_ACC,7);
          while(!spi_xfer_done){}
          spi_xfer_done=false;
          output_buffer[6]=0; //identifier for each board
          for(int i=0;i<6;i++){
            output_buffer[i] = m_rx_buf_ACC[i+1];
          }

}


//bool newAccDataAvailable(){
//   bool dataIsAvailable = false;

//   nrf_drv_spi_transfer(&spi, m_tx_buf0, 1, m_rx_buf, 2);
//   while(!spi_xfer_done){}
//   spi_xfer_done=false;
//   if((m_rx_buf[1] & 0x01) == 0x01){
//      dataIsAvailable=true;
//   }
//   return dataIsAvailable;

//}


int main(void)
{
    // Initialize.

    log_init();

    //timer_init();
    //power_management_init();
    //ble_stack_init();
    //gap_params_init();
    //gatt_init();
    //advertising_data_set();
    //set_responder();


    //server_init();

    //gatt_mtu_set(m_test_params.att_mtu);
    //conn_evt_len_ext_set(m_test_params.conn_evt_len_ext_enabled);
    
    ////SPI init:
    //nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
    //spi_config.ss_pin   = SPI_SS_PIN;
    //spi_config.miso_pin = SPI_MISO_PIN;
    //spi_config.mosi_pin = SPI_MOSI_PIN;
    //spi_config.sck_pin  = SPI_SCK_PIN;
    //spi_config.mode = NRF_DRV_SPI_MODE_0;
    //spi_config.frequency = NRF_DRV_SPI_FREQ_2M; //2147483648 = 8MHz
    //APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler, NULL));



    //Write SPI settings to IMU chip:
    //nrf_drv_spi_transfer(&spi, m_tx_buf1, 2, m_rx_buf1, 2);
    //while(!spi_xfer_done){}
    //spi_xfer_done=false;


    NRF_LOG_INFO("ATT MTU example started.");
    NRF_LOG_INFO("Press button 3 on the board connected to the PC.");
    NRF_LOG_INFO("Press button 4 on other board.");
    uint32_t volatile delay_us = 500000;
    int j = 0;
    m_run_test = false;


    // Enter main loop.
    for (;;)
      {
      }
}


/**
 * @}
 */
